#!/bin/bash

tokens=(
#  "8407022066:AAE_aztkTfyjkl66NRuBF6J1MhTxt3pqgUo"
#  "8332708016:AAGTbm6RVTe3eSt9UWbkU8VCGSSrn6nADJc"
#  "8339608498:AAH54orBOj6Cw-NmyIO3TWZ9rbS_OBMj_eE"
#  "8410274951:AAG0LtebaNr-WaYMoqMBJtiL_NYdqKWS6Ks"
 # "7973953933:AAG3E-kLso68hfAsCrZR4smc0uL8Ulg3fKk"
#  "8234310100:AAFh8hwhC0EuWsKKKPdnu3gNcnfiMXQDeLE"
  #"8287978101:AAEA8zOoDuv5T9aStKjvUldFFtQp8PgJoFc"
 # "7689012030:AAGgSWurMUElwFPnh6xkEniXkzjBKQhERqI"
 # "5520213910:AAF0Y15i-s-dnZiLVM6xCxAp7e5-WHz70Lc"
 # "7609887102:AAF9vMxFQPI8ffJ4uRzh1PRgjnA-7-89VzM"
  "7689012030:AAGgSWurMUElwFPnh6xkEniXkzjBKQhERqI"
  "5520213910:AAF0Y15i-s-dnZiLVM6xCxAp7e5-WHz70Lc"
  "7609887102:AAF9vMxFQPI8ffJ4uRzh1PRgjnA-7-89VzM"
)

user_id="6954351098"
chat_id="-1002055831189"
reply_id="699326"
clean_text="بالاباش ناموص پلنگ صورتی کیر غلامعلی حداد عادل بکنم تو کص مادرت ناموص حشیشی روانی شدی زشته ننت هرروز بهم کص میدع تو چص باشی دفاع نکنی یتیم ممبر چصک رادیو تو کص ننت نظر؟بیام برق 800 هرتز وصل کنم ب کص ننت یتیم دستگیره در دسشویی بیت رهبری تو کص ننت چص خار مادر موریانه نمک و فلفل تو کص ننت کص نوت رشته رشته میکنم میبافم شرت بشه برا خواهر جندت تف تو ممه ها ابجیت پیتزا تو کص ننت مادر چوب خور ناموص یاغی خواهر شارژر ساز کیرم تو ناله های ننت چصو ناموس کیرم سلام کرد به کص سفید مادرت تخمم خداحافظی کرد خارکصه ننت ب زیرم واس درد کیرم پمپ چاه فاضلاب میذارم تو کص ننت ابکص استخراج کنع ناموص ایکیو پایین ننه لز کص ننع تتو شده سوپر ننت 40 گیگ دارم اپلودش کنم پورن هاب پول ویو بگیرم ننه راننده اتوبوس واحد کود پشکل باغ تو کص ننت مادر گیگا سینز ننه حیض مادر کص اتوماتیک ننه کص دیزل گازوئیلی تتخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخخ کص مادرت شد داش خعلی بدبختی تو باید التماس کنی هی بمالی تا ولت کنم مشت تو کص ننت پرده خارت با اره ببرم ننه غیرباکره خار قالی شور کیرو خایم به رحم ناموصت چص خار کیرم تو اول و اخرت خارکصه مادرجندع ننه کله‌ کیری ناموص دهه شصتی ننه اگزوز دار کیرم با زاویه ۶۰ درجه تو کص ننت مادر اسپورت ناموص نیسان سوار ننه ترسو خواهر شهوتی کیرم تو کص اتوماتیک ننت کیرم رو زبون ابجیت کیرم تو پیشونی سفید ننت کیرم تو لحظه های لذت بخشی که با مادرت گذراندم کیرم به نقطه کلیتوریس مادرت درخت حیفه تو کص ننت بره خارکصع حرومزادع خخخخخخخخخخخخخخه یتیم مادر لونی کیری ناموص چص ابلح ممبر خایه نکن ننه روانی خواهر مریض دیوث پدر کیر کلفت حضرت جف راتن کبیر به کص ننت فرو شه الهی ننت وقتی اوباهت حضرت جف راتن میبینه از ترس پریود میشه خخخخخخخخخخخخخخخخ حروم لقمه شوفر ناموص نن نن کن تا منم صدای ننتو در بیارم خارت بفرستم فضا ب ناسا کص بده حرومزاده کله مار کبرا تو کس ننت چراشاخ میشی چقدر باید ننت بگام ننت داره برام کارگری می‌کنه بیل فرو می‌کنه تو خاک کیر نوتوریوس بی ای جی تو چوچول ننت تو باس هی کیر بخوری خایه مالی کنی تا برسی به من ننه چرب خواهر کاندوم به دست قضیه فیثاغورث تو کس ننت کیرم تو قلب پاک و معصوم مادرت کیرم تو دفترچه خاطراتی که با ننت دارم مثلث فیثاغورث تو کص ننت مادر ریاضی دان مادر سیاستمدار کیرم تو سوراخ چپ دماغ مادرت کیرم تو چشم راست مادرت پخخخخخخخخخخخخخی کردم تو کص ننت ترسیدی فرار کردی کیرم تو گور زنده مردت کیرم تو اشهد آخر ننت مادر امینم فن کیر تو سیگار صورتی تو دهن ننت خارکصع سال ۱۲ ماه ۱۳ ماهش من رو ننتم هشتصد سال پیش من و ارسطو و افلاطون تو همین گروه جدت سیک کردیم شمارش زدیم تو چص ممبر گوز زاده داری الان شاخ میشی کیرم به لب و لوچه ماتیکی ننت بزن ب چاک حرومزاده وگرنه رضا شاه از قبر میکشم بیرون کیر کلفتش میکنم تو کص ننت بای"

# Now the full Markdown message
text="[${clean_text}](tg://user?id=${user_id})"

echo ${text}
i=0

while true; do
  token_index=$((i % 3))
  token=${tokens[$token_index]}

  status_code=$(curl -s -o /dev/null -w "%{http_code}" -X POST "https://api.telegram.org/bot${token}/sendMessage" \
    -H "Content-Type: application/json" \
    -d "{
      \"chat_id\": ${chat_id},
      \"text\": \"[$clean_text](tg://user?id=$user_id)\",
      \"parse_mode\": \"MarkdownV2\"
    }")
    
#,
#      \"reply_to_message_id\": ${reply_id}
 
  echo "[$(date)] Token #$token_index -> HTTP $status_code"

  if [[ "$status_code" == "429" ]]; then
    echo "Rate limited cuh... sleeping 30s"
    sleep 30
  else
    sleep 2
  fi

  ((i++))
done
